# Taps
tap "adoptopenjdk/openjdk"
tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Brews (Packages)
brew "azure-cli"
brew "bat"
brew "cocoapods"
brew "handbrake"
brew "mas"
brew "nvm"
brew "tomcat@7"
brew "watchman"

# Casks (Applications / Fonts)
cask "adoptopenjdk8"
cask "dropbox"
cask "font-cascadia-code-pl"
cask "font-code-new-roman-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-source-code-pro"
cask "lulu"
cask "microsoft-auto-update"
cask "microsoft-edge"

# Mac Apple Store Apps
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "Skitch", id: 425955336
mas "Spark", id: 1176895641
mas "Things", id: 904280696
mas "Time Out", id: 402592703
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
